"=================================List================================="
# списки - изменяемый, индексируемый, упорядоченный, итерируемый тип данных, предназначенный для хранения любых данных в определенном порядке

list1 = [1, 2, 3, 'hello', [2, 4, 0.4], None, True]
list1[3] # 'hello'
list1[3][-1] # 'o'
list1[-1] # True
list1[4] # [2, 4, 0.4]
list1[4][0] # 2

list2 = list("hello")
# ['h', 'e', 'l', 'l', 'o']

list3 = list(range(1,11))
# [1,2,3,4,5,6,7,8,9,10]

list4 = [1] * 5
# [1,1,1,1,1]


"=====================Методы списков====================="
# append - добавляет элемент в конец списка
list2 = []
list2.append(1)
print(list2) # [1]
list2.append("hello")
print(list2) # [1, 'hello']

# pop - удаляет элемнт из списка по индексу
list2.pop(0)
print(list2) # ['hello']

# remove - удаляет элемент из списка по значению
list2.remove('hello')
print(list2) # []

list3 = [1,2,3,4,1,1,3,2,5]
list3.remove(1)
# [2,3,4,1,1,3,2,5]
